(function () {
    'use strict';

    angular.module('app.main', [

    ]).config(config);

    config.$inject = ['$translateProvider'];

    function config($translateProvider) {
        $translateProvider.translations('ua', {
            main: {
                'whatAreYouLookingFor': 'Що ви шукаєте...',
                'needs': 'Потреби',
                'offers': 'Пропозиції',
                'lastNeeds': 'Останні потреби',
                'lastOffers': 'Останні пропозиції',
                'author': 'Автор:',
                'aboutUs': {
                    'title': 'Про нас',
                    'p1': 'Благодійна організація є одним з видів некомерційної організації (НКО). ' +
                    'Він відрізняється від інших видів НКО тим, що зосереджується на некомерційних ' +
                    'і благодійних цілях, а також на соціальному благополуччі ' +
                    '(наприклад благодійних, освітніх, релігійних чи інших заходах, ' +
                    'службі інтересам суспільства або загального блага).',
                    'p2': 'Юридичне визначення благодійної організації (і Милосердя) варіюється ' +
                    'залежно від країни і в деяких випадках від області країни, в якій діє ' +
                    'благодійна організація. Регулювання, оподаткування і те, яким чином ' +
                    'закон про благодійництво впливає на благодійні організації також змінюється.',
                    'p3': 'Фінансові показники (наприклад, повернення податків, ' +
                    'доходи від збору коштів, доходи від продажу товарів і послуг або дохід ' +
                    'від інвестицій) є важливими показниками для оцінки фінансової стійкості ' +
                    'благодійності, особливо для благодійних оцінювачів. Ця інформація може ' +
                    'вплинути на репутацію жертводавців та товариств, і таким чином ' +
                    'на фінансові вигоди благодійної організації.',
                    'p4': 'Благодійні організації часто залежать частково від пожертвувань для ' +
                    'некомерційних організацій. Такі пожертви благодійних організацій являють ' +
                    'собою важливий вид корпоративної благодійності'
                }
            }
        });
        $translateProvider.translations('ru', {
            main: {
                'whatAreYouLookingFor': 'Что вы ищете...',
                'needs' : 'Потребности',
                'offers': 'Предложения',
                'lastNeeds': 'Последние потребности',
                'lastOffers': 'Последние предложения',
                'author': 'Автор:',
                'aboutUs': {
                    'title': 'О нас',
                    'p1': 'Благотворительная организация является одним из видов некоммерческой организации (НКО). ' +
                    'Он отличается от других видов НКО тем, что сосредотачивается на некоммерческих ' +
                    'и благотворительных целях, а также социальном благополучии ' +
                    '(например благотворительных, образовательных, религиозных или иных мероприятиях ' +
                    'служащих интересам общества или общего блага).',
                    'p2': 'Юридическое определение благотворительной организации (и Милосердия) варьируется ' +
                    'в зависимости от страны и в некоторых случаях от области страны, в которой действует ' +
                    'благотворительная организация. Регулирования, налогообложения и то, каким образом ' +
                    'закон о благотворительности влияет на благотворительные организации также меняется.',
                    'p3': 'Финансовые показатели (например, возврат налогов, ' +
                    'доходы от сбора средств, доходы от продажи товаров и услуг или доход ' +
                    'от инвестиций) являются важными показателями для оценки финансовой устойчивости ' +
                    'благотворительности, особенно для благотворительных оценщиков. Эта информация может ' +
                    'повлиять на репутацию жертвователей и органицаций, и таким образом ' +
                    'на финансовые выгоды благотворительной организации. ',
                    'p4': 'Благотворительные организации часто зависят частично от пожертвований для ' +
                    'некоммерческих организаций. Такие пожертвования благотворительных организаций представляют ' +
                    'собой важный вид корпоративной благотворительности'
                }
            }
        });
    }
})();
