/*jshint multistr: true */
(function () {
    'use strict';

    angular
        .module('app.needs')
        .factory('NeedsFactory', NeedsFactory);

    function NeedsFactory() {
        return {
            getNeeds: function() {
                //tbd when there will be api to call, till that time hardcoded the
                //vm.needs array to verify if factory is properly working
                /*$http.get("/api/needs").success(function(data) {
                    vm.needs = data;
                })*/
                var needs = [
                    {
                        desc: 'Необхідні зимові штани #1 для центру "Джерело".',
                        body: '1 Необхідний набір одягу для волонтерського центру' +
                        'джерело, найбільша потреба в теплих куртках, шкарпетках,' +
                        'зимових штанах, також необхідна їжа і мінеральна вода.',
                        location: 'Львів',
                        date: '2015-02-21',
                        author: 'Микола Мартинюк',
                        project: 'допомога дитячому будинку "Надія"'
                    },
                    {
                        desc: 'Необхідні зимові штани #2 для центру "Джерело".',
                        body: '2 Необхідний набір одягу для волонтерського центру' +
                        'джерело, найбільша потреба в теплих куртках, шкарпетках,' +
                        'зимових штанах, також необхідна їжа і мінеральна вода. ',
                        location: 'Київ',
                        date: '2015-02-22',
                        author: 'Артур Степанюк',
                        project: 'допомога дитячому будинку "Надія"'

                    },
                    {
                        desc: 'Необхідні зимові штани #3 для центру "Джерело".',
                        body: '3 Необхідний набір одягу для волонтерського' +
                        'центру джерело, найбільша потреба в теплих куртках,' +
                        'шкарпетках, зимових штанах, також необхідна їжа і мінеральна вода. ',
                        location: 'Івано-Франківськ',
                        date: '2015-02-23',
                        author: 'Євген Пащенко',
                        project: 'допомога дитячому будинку "Надія"'
                    },
                    {
                        desc: 'Необхідні зимові штани #4 для центру "Джерело".',
                        body: '4 Необхідний набір одягу для волонтерського' +
                        'центру джерело, найбільша потреба в теплих куртках,' +
                        'шкарпетках, зимових штанах, також необхідна їжа і мінеральна вода. ',
                        location: 'Івано-Франківськ',
                        date: '2015-03-25',
                        author: 'Андрій Олексишин',
                        project: 'допомога дитячому будинку "Надія"'
                    },
                    {
                        desc: 'Необхідні зимові штани #5 для центру "Джерело".',
                        body: '5 Необхідний набір одягу для волонтерського' +
                        'центру джерело, найбільша потреба в теплих куртках,' +
                        'шкарпетках, зимових штанах, також необхідна їжа і мінеральна вода. ',
                        location: 'Івано-Франківськ',
                        date: '2015-04-20',
                        author: 'Андрій Сеник',
                        project: 'допомога дитячому будинку "Надія"'
                    },
                    {
                        desc: 'Необхідні зимові штани #6 для центру "Джерело".',
                        body: '6 Необхідний набір одягу для волонтерського' +
                        'центру джерело, найбільша потреба в теплих куртках,' +
                        'шкарпетках, зимових штанах, також необхідна їжа і мінеральна вода. ',
                        location: 'Івано-Франківськ',
                        date: '2015-01-02',
                        author: 'Микола Шевчук',
                        project: 'допомога дитячому будинку "Надія"'
                    }
                ];
                return needs;
            }
        };
    }

})();
